#+TITLE: emacs
#+AUTHOR: Galih Wicaksono
#+TAGS: emacs(e) arduino(a) web(w)
#+ORGA_PUBLISH_KEYWORD: PUBLISHED
#+TODO: DRAFT | PUBLISHED
#+STARTUP: fold


** Blocks

Code Blocks.

Using ~:exports code~
#+BEGIN_SRC js :exports code
  console.log(`Only the code should be exported, not the results`)
#+END_SRC

#+RESULTS:
: Hello Org
: undefined

Using ~:exports none~
#+BEGIN_SRC js 
  console.log(`This shouldn't be exported`)
#+END_SRC

Block Quote.
#+BEGIN_QUOTE
I think if you do something and it turns out pretty good, then you should go do
something else wonderful, not dwell on it for too long. Just figure out what’s
next.
#+END_QUOTE

Example Block.
#+BEGIN_EXAMPLE
npm install orga
#+END_EXAMPLE

Comments (you are not expected to see anything here).
#+BEGIN_COMMENT
You are not suppose to see this.
#+END_COMMENT

Center.
#+BEGIN_CENTER
This line should be centered.
#+END_CENTER

Verse.
#+BEGIN_VERSE
Great clouds overhead
 Tiny black birds rise and fall
 Snow covers Emacs

     -- AlexSchroeder
#+END_VERSE

